In [1]:
# ********** GENERAL SET UP ****************************************************

# Import libraries
import pandas as pd
import numpy as ny

In [2]:
# Define pathways to files
schools_csv = "raw_data/schools_complete.csv"
students_csv = "raw_data/students_complete.csv"

In [3]:
# Read the pathways and define the dataframe(s) - Part 1
schools_df = pd.read_csv(schools_csv)
schools_df.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
# Read the pathways and define the dataframe(s) - Part 2
students_df = pd.read_csv(students_csv)
students_df.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
# ********** SET COMMON COLUMN AND MERGE FILES *********************************

In [6]:
#Rename School name in school_df to "school" so we can merge on "school" between the two dataframes
schools_df = schools_df.rename(columns={"name":"school"})
schools_df.head()

   School ID                 school      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [7]:
# Merge the two dataframes into a new, single dataframe
combined_df = pd.merge(schools_df, students_df, on="school")
combined_df.head()

,School ID,school,type,size,budget,Student ID,name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [8]:
# ********** GET GENERAL STATS FROM DATA ***************************************
#count total schools
total_schools = schools_df["School ID"].count()
total_schools

15

In [9]:
#count total students
total_students = students_df["Student ID"].count()
total_students

39170

In [10]:
#sum total budget
total_budget = schools_df["budget"].sum()
total_budget

24649428

In [11]:
#average math score
ave_math_score = students_df["math_score"].mean()
ave_math_score

78.98537145774827

In [12]:
#average reading score
ave_reading_score = students_df["reading_score"].mean()
ave_reading_score

81.87784018381414

In [13]:
# ********** CREATE BINS AND GROUPS SO CAN CALC PERCENTAGES********************
# Start with "% passing math" first____________________________________________
# Create bins
bins = [0,60,70,80,90,100]
score_range =["F","D","C","B","A"]
pd.cut(students_df["math_score"],bins,labels=score_range).head()

0    C
1    D
2    F
3    F
4    B
Name: math_score, dtype: category
Categories (5, object): [F < D < C < B < A]

In [14]:
# Place the data series into a new column inside of the DataFrame
students_df["Math Grade Group"] = pd.cut(students_df["math_score"],bins,labels=score_range)
students_df.head()

,Student ID,name,gender,grade,school,reading_score,math_score,Math Grade Group
0,0,Paul Bradley,M,9th,Huang High School,66,79,C
1,1,Victor Smith,M,12th,Huang High School,94,61,D
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,F
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,F
4,4,Bonnie Ray,F,9th,Huang High School,97,84,B

In [15]:
# Create a GroupBy object based upon "Math Grade Group"
math_grade_group = students_df.groupby("Math Grade Group")

print(math_grade_group["Math Grade Group"].count())

Math Grade Group
F    3562
D    7252
C    9751
B    9771
A    8834
Name: Math Grade Group, dtype: int64

In [16]:
math_grade_group.mean()

                    Student ID  reading_score  math_score
Math Grade Group
F                 19511.761931      80.899495   57.517687
D                 19531.180640      81.664368   66.055985
C                 19573.217106      81.969131   75.475849
B                 19692.039607      82.134173   85.453178
A                 19551.107992      82.063278   94.975436

In [17]:
students_df["Math Grade Group"].head()

0    C
1    D
2    F
3    F
4    B
Name: Math Grade Group, dtype: category
Categories (5, object): [F < D < C < B < A]

In [18]:
# Extract rows corresponding only to people who failed math
failed_math = students_df.loc[students_df["Math Grade Group"] == "F"]
failed_math.head()

,Student ID,name,gender,grade,school,reading_score,math_score,Math Grade Group
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,F
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,F
16,16,Donald Zamora,M,9th,Huang High School,88,55,F
27,27,Tracey Oconnor,F,10th,Huang High School,80,58,F
28,28,Kelly James,F,11th,Huang High School,73,55,F

In [19]:
# Define the failed_math_count
failed_math_count = len(failed_math["Student ID"])
failed_math_count

3562

In [20]:
total_math_count = students_df.count()
percent_failed_math = (failed_math_count/total_math_count)*100
percent_failed_math

Student ID          9.093694
name                9.093694
gender              9.093694
grade               9.093694
school              9.093694
reading_score       9.093694
math_score          9.093694
Math Grade Group    9.093694
dtype: float64

In [21]:
percent_failed_math2 = percent_failed_math["Student ID"]
percent_failed_math2

9.093694153689048

In [22]:
percent_passed_math = 100 - percent_failed_math2
percent_passed_math = percent_passed_math.round(2)
percent_passed_math

90.91

In [23]:
# Now do "% passing reading" first____________________________________________
# Create bins
bins = [0,60,70,80,90,100]
score_range =["F","D","C","B","A"]
pd.cut(students_df["reading_score"],bins,labels=score_range).head()

0    D
1    A
2    B
3    D
4    A
Name: reading_score, dtype: category
Categories (5, object): [F < D < C < B < A]

In [24]:
# Place the data series into a new column inside of the DataFrame
students_df["Reading Grade Group"] = pd.cut(students_df["reading_score"],bins,labels=score_range)
students_df.head()

,Student ID,name,gender,grade,school,reading_score,math_score,Math Grade Group,Reading Grade Group
0,0,Paul Bradley,M,9th,Huang High School,66,79,C,D
1,1,Victor Smith,M,12th,Huang High School,94,61,D,A
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,F,B
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,F,D
4,4,Bonnie Ray,F,9th,Huang High School,97,84,B,A

In [25]:
reading_grade_group = students_df.groupby("Reading Grade Group")

print(reading_grade_group["Reading Grade Group"].count())

Reading Grade Group
F        0
D     6670
C    11169
B    11352
A     9979
Name: Reading Grade Group, dtype: int64

In [26]:
reading_grade_group.mean()

                       Student ID  reading_score  math_score
Reading Grade Group
F                             NaN            NaN         NaN
D                    19731.886507      66.822939   77.918891
C                    19625.103232      75.529054   79.161339
B                    19550.430144      85.460447   79.197498
A                    19479.298627      94.970939   79.259946

In [27]:
students_df["Reading Grade Group"].head()

0    D
1    A
2    B
3    D
4    A
Name: Reading Grade Group, dtype: category
Categories (5, object): [F < D < C < B < A]

In [28]:
# Extract rows corresponding only to people who failed reading
failed_reading = students_df.loc[students_df["Reading Grade Group"] == "F"]
failed_reading.head()

Empty DataFrame
Columns: [Student ID, name, gender, grade, school, reading_score, math_score, Math Grade Group, Reading Grade Group]
Index: []

In [29]:
# Define the failed_reading_count
failed_reading_count = len(failed_reading["Student ID"])
failed_reading_count

0

In [30]:
total_reading_count = students_df.count()
percent_failed_reading = (failed_reading_count/total_reading_count)*100
percent_failed_reading

Student ID             0.0
name                   0.0
gender                 0.0
grade                  0.0
school                 0.0
reading_score          0.0
math_score             0.0
Math Grade Group       0.0
Reading Grade Group    0.0
dtype: float64

In [31]:
percent_failed_reading2 = percent_failed_reading["Student ID"]
percent_failed_reading2

0.0

In [32]:
percent_passed_reading = 100 - percent_failed_reading2
percent_passed_reading = percent_passed_reading.round(2)
percent_passed_reading

100.0

In [33]:
# Now average reading and math to get the Overall Passing Rate
overall_pass_rate=(percent_passed_reading+percent_passed_math)/2
overall_pass_rate

95.455

In [34]:
# ********** CREATE A SUMMARY TABLE (DISTRICT-LEVEL)***********************
district_summary = pd.DataFrame({"Total Schools":[total_schools],
                                 "Total Students":[total_students],
                                 "Total Budget":[total_budget], 
                                 "Average Math Score":[ave_math_score],
                                 "Average Reading Score":[ave_reading_score],
                                 "% Passed Math":[percent_passed_math],
                                 "% Passed Reading":[percent_passed_reading],
                                 "Overall Passing Rate":[overall_pass_rate]
})
district_summary

,% Passed Math,% Passed Reading,Average Math Score,Average Reading Score,Overall Passing Rate,Total Budget,Total Schools,Total Students
0,90.91,100.0,78.985371,81.87784,95.455,24649428,15,39170

In [35]:
district_summary_ordered = district_summary[["Total Schools", 
                                             "Total Students", 
                                             "Total Budget",
                                             "Average Math Score",
                                             "Average Reading Score",
                                             "% Passed Math", 
                                             "% Passed Reading",
                                             "Overall Passing Rate"]]
district_summary_ordered

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passed Math,% Passed Reading,Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,90.91,100.0,95.455

In [36]:
# Improve formatting
district_summary_ordered["Total Students"]=district_summary_ordered["Total Students"].map("{0:,.0f}".format)
district_summary_ordered["Total Budget"]=district_summary_ordered["Total Budget"].map("${0:,.0f}".format)

district_summary_ordered = district_summary_ordered.round(2)
district_summary_ordered

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passed Math,% Passed Reading,Overall Passing Rate
0,15,"39,170","$24,649,428",78.99,81.88,90.91,100.0,95.46